config/cf/Catalogs/Дела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Дела</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЦелиДела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбзора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоОбзора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКонтексты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Избранное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНачало</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обзор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбзорКаждые</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбзорКаждыеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбзорПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отметка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсвечено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпрятатьВToDo</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроектовДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Усилие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПапка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контексты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контекст</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контексты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ВидЦелиДела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидЦелиДела</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/СтатусыПроектовДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтатусыПроектовДел</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеНачался</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Идет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/Дела/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ИгнорироватьЗапись") Тогда
		Возврат;
	КонецЕсли;
    
	Если ЗначениеЗаполнено(Идентификатор) И ДополнительныеСвойства.Свойство("ИгнорированиеПроверок") = Ложь Тогда
        ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нельзя изменять ключевые реквизиты предопределенных элеметов дел'"));
        Отказ = Истина;
        Возврат;
	КонецЕсли;
    
	мТекДата = ТекущаяДатаСеанса();
	
	// Даты.
	Если ДатаСоздания = Дата(1, 1, 1) Тогда
		ДатаСоздания = мТекДата;
	КонецЕсли;
	ДатаВыполнения 		= ?(Выполнено = Истина, мТекДата, Дата(1, 1, 1));
	ДатаКорректировки 	= мТекДата;
		
	ИспользоватьСтиль = НЕ ПустаяСтрока(Стиль);
	
	Если ЭтоПапка = Истина Тогда
		Выполнено = Ложь;
	КонецЕсли;
		
	Если ЭтоНовый() Тогда
		Важность 	= 100;
		Срочность 	= 100;
		Усилие		= 100;
		Обзор		= Ложь;
		ОбзорКаждые = 1;
		ОбзорПериод = 1;
		Картинка	= -1;
        ВидЦели     = Перечисления.ВидЦелиДела.Нет;
        СтатусПроекта = Перечисления.СтатусыПроектовДел.НеНачался;
    	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
    		Пользователь = Пользователи.ТекущийПользователь();
    	КонецЕсли;
	КонецЕсли;
	
	ЕстьОписание = НЕ ПустаяСтрока(Описание);
	ЕстьКонтексты = Контексты.Количество() > 0;
	
	ОбзорКаждыеСтрокой = Формат(ОбзорКаждые, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") + " ";
	Если ОбзорПериод = 0 Тогда
		ОбзорКаждыеСтрокой = ОбзорКаждыеСтрокой + НСтр("ru = 'дн.'");
	ИначеЕсли ОбзорПериод = 1 Тогда
		ОбзорКаждыеСтрокой = ОбзорКаждыеСтрокой + НСтр("ru = 'нед.'");
	ИначеЕсли ОбзорПериод = 2 Тогда
		ОбзорКаждыеСтрокой = ОбзорКаждыеСтрокой + НСтр("ru = 'мес.'");
	КонецЕсли;
	    
    #Область ИзменениеЭтоПроект    
    // Перезаписываем реквизит "ЭтоПроект"
    Если ЭтоНовый() ИЛИ Ссылка.ЭтоПроект <> ЭтоПроект Тогда
        
        Если ЭтоНовый() Тогда
        	Проект = Родитель.Проект;
        Иначе            
            Запрос = Новый Запрос();
            Запрос.УстановитьПараметр("Ссылка", Ссылка);
            Если ЭтоПроект = Истина Тогда
                Запрос.Текст =
                    "ВЫБРАТЬ
                    |   Дела.Ссылка КАК Ссылка,
                    |   Дела.ЭтоПроект КАК ЭтоПроект,
                    |   Дела.Родитель КАК Родитель
                    |ИЗ
                    |   Справочник.Дела КАК Дела
                    |ГДЕ
                    |   Дела.ПометкаУдаления = ЛОЖЬ
                    |   И Дела.Ссылка В ИЕРАРХИИ(&Ссылка)
                    |   И Дела.Ссылка <> &Ссылка
                    |
                    |УПОРЯДОЧИТЬ ПО
                    |   Ссылка ИЕРАРХИЯ";
                
                МассивИгнорируемыхДел = Новый Массив;
                Выборка = Запрос.Выполнить().Выбрать();
                Пока Выборка.Следующий() Цикл
                    
                    Если Выборка.ЭтоПроект Тогда
                        Об          = Выборка.Ссылка.ПолучитьОбъект();
                        Об.Проект   = Ссылка;
                        ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                        Об.Записать();                    
                    	МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                    Иначе
                        Если МассивИгнорируемыхДел.Найти(Выборка.Родитель) <> Неопределено Тогда
                        	МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                        Иначе
                            Об          = Выборка.Ссылка.ПолучитьОбъект();
                            Об.Проект   = Ссылка;
                            ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                            Об.Записать();                    
                        КонецЕсли; 
                    КонецЕсли; 
                                
                КонецЦикла;
            Иначе
                Запрос.Текст =
                    "ВЫБРАТЬ
                    |   Дела.Ссылка КАК Ссылка
                    |ИЗ
                    |   Справочник.Дела КАК Дела
                    |ГДЕ
                    |   Дела.ПометкаУдаления = ЛОЖЬ
                    |   И Дела.Проект = &Ссылка";
                
                Выборка = Запрос.Выполнить().Выбрать();
                Пока Выборка.Следующий() Цикл
                    Об          = Выборка.Ссылка.ПолучитьОбъект();
                    Об.Проект   = Проект;
                    ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                    Об.Записать();                    
                КонецЦикла;                
            КонецЕсли; 
        	
        КонецЕсли; 
                   
    КонецЕсли;
    #КонецОбласти
    
    #Область ИзменениеРодитель
    Если ЭтоНовый() = Ложь И Ссылка.Родитель <> Родитель Тогда
		
		Если ЗначениеЗаполнено(Родитель) Тогда
        	РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, "ЭтоПроект,Проект");
  	    	Проект = ?(РеквизитыРодителя.ЭтоПроект, Родитель, РеквизитыРодителя.Проект);
	  	Иначе
			Если ЭтоПроект = Ложь Тогда
				Проект = Справочники.Дела.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
        
        Запрос = Новый Запрос();
        Запрос.УстановитьПараметр("Ссылка", Ссылка);
        Запрос.Текст =
            "ВЫБРАТЬ
            |   Дела.Ссылка КАК Ссылка,
            |   Дела.ЭтоПроект КАК ЭтоПроект,
            |   Дела.Родитель КАК Родитель
            |ИЗ
            |   Справочник.Дела КАК Дела
            |ГДЕ
            |   Дела.ПометкаУдаления = ЛОЖЬ
            |   И Дела.Ссылка В ИЕРАРХИИ(&Ссылка)
            |   И Дела.Ссылка <> &Ссылка
            |
            |УПОРЯДОЧИТЬ ПО
            |   Ссылка ИЕРАРХИЯ";
        
        Выборка = Запрос.Выполнить().Выбрать();
        Если ЭтоПроект = Ложь Тогда
                        
            МассивИгнорируемыхДел = Новый Массив;
            Пока Выборка.Следующий() Цикл
                
                Если Выборка.ЭтоПроект Тогда
                    МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                Иначе
                    Если МассивИгнорируемыхДел.Найти(Выборка.Родитель) <> Неопределено Тогда
                        МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                    Иначе
                        Об          = Выборка.Ссылка.ПолучитьОбъект();
                        Об.Проект   = Проект;
                        ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                        Об.Записать();                    
                    КонецЕсли; 
                КонецЕсли; 
                            
            КонецЦикла;
            
            Выборка.Сбросить();
        КонецЕсли;
        
    КонецЕсли;
    #КонецОбласти
		
	ДополнительныеСвойства.Вставить("НеВыполнятьПравилаСобытий", Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
